---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCollection.GetBasicIEnumerator
source: html/4c273eac-7860-4baa-37c3-e826e502642f.htm
---
# Autodesk.Revit.DB.PointClouds.PointCollection.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.